{
  "_name_or_path": "./models/ClinicalBERT",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-CARDINAL",
    "2": "I-CARDINAL",
    "3": "B-ORGANISM",
    "4": "I-ORGANISM",
    "5": "B-CELL",
    "6": "I-CELL",
    "7": "B-BACTERIUM",
    "8": "I-BACTERIUM",
    "9": "B-LABORATORY_OR_TEST_RESULT",
    "10": "I-LABORATORY_OR_TEST_RESULT",
    "11": "B-CELL_COMPONENT",
    "12": "I-CELL_COMPONENT",
    "13": "B-PERSON",
    "14": "I-PERSON",
    "15": "B-MACHINE_ACTIVITY",
    "16": "I-MACHINE_ACTIVITY",
    "17": "B-SIGN_OR_SYMPTOM",
    "18": "I-SIGN_OR_SYMPTOM",
    "19": "B-BODY_SUBSTANCE",
    "20": "I-BODY_SUBSTANCE",
    "21": "B-TIME",
    "22": "I-TIME",
    "23": "B-SUBSTRATE",
    "24": "I-SUBSTRATE",
    "25": "B-CELL_FUNCTION",
    "26": "I-CELL_FUNCTION",
    "27": "B-ORDINAL",
    "28": "I-ORDINAL",
    "29": "B-HUMAN-CAUSED_PHENOMENON_OR_PROCESS",
    "30": "I-HUMAN-CAUSED_PHENOMENON_OR_PROCESS",
    "31": "B-EVOLUTION",
    "32": "I-EVOLUTION",
    "33": "B-IMMUNE_RESPONSE",
    "34": "I-IMMUNE_RESPONSE",
    "35": "B-EDUCATIONAL_ACTIVITY",
    "36": "I-EDUCATIONAL_ACTIVITY",
    "37": "B-FOOD",
    "38": "I-FOOD",
    "39": "B-LANGUAGE",
    "40": "I-LANGUAGE",
    "41": "B-GPE",
    "42": "I-GPE",
    "43": "B-BODY_PART_ORGAN_OR_ORGAN_COMPONENT",
    "44": "I-BODY_PART_ORGAN_OR_ORGAN_COMPONENT",
    "45": "B-SOCIAL_BEHAVIOR",
    "46": "I-SOCIAL_BEHAVIOR",
    "47": "B-EVENT",
    "48": "I-EVENT",
    "49": "B-TISSUE",
    "50": "I-TISSUE",
    "51": "B-FAC",
    "52": "I-FAC",
    "53": "B-MONEY",
    "54": "I-MONEY",
    "55": "B-MATERIAL",
    "56": "I-MATERIAL",
    "57": "B-DAILY_OR_RECREATIONAL_ACTIVITY",
    "58": "I-DAILY_OR_RECREATIONAL_ACTIVITY",
    "59": "B-ORGAN_OR_TISSUE_FUNCTION",
    "60": "I-ORGAN_OR_TISSUE_FUNCTION",
    "61": "B-GENE_OR_GENOME",
    "62": "I-GENE_OR_GENOME",
    "63": "B-DIAGNOSTIC_PROCEDURE",
    "64": "I-DIAGNOSTIC_PROCEDURE",
    "65": "B-THERAPEUTIC_OR_PREVENTIVE_PROCEDURE",
    "66": "I-THERAPEUTIC_OR_PREVENTIVE_PROCEDURE",
    "67": "B-VIRAL_PROTEIN",
    "68": "I-VIRAL_PROTEIN",
    "69": "B-INJURY_OR_POISONING",
    "70": "I-INJURY_OR_POISONING",
    "71": "B-GROUP",
    "72": "I-GROUP",
    "73": "B-LIVESTOCK",
    "74": "I-LIVESTOCK",
    "75": "B-DATE",
    "76": "I-DATE",
    "77": "B-ARCHAEON",
    "78": "I-ARCHAEON",
    "79": "B-RESEARCH_ACTIVITY",
    "80": "I-RESEARCH_ACTIVITY",
    "81": "B-INDIVIDUAL_BEHAVIOR",
    "82": "I-INDIVIDUAL_BEHAVIOR",
    "83": "B-PHYSICAL_SCIENCE",
    "84": "I-PHYSICAL_SCIENCE",
    "85": "B-LOC",
    "86": "I-LOC",
    "87": "B-GOVERNMENTAL_OR_REGULATORY_ACTIVITY",
    "88": "I-GOVERNMENTAL_OR_REGULATORY_ACTIVITY",
    "89": "B-EUKARYOTE",
    "90": "I-EUKARYOTE",
    "91": "B-CORONAVIRUS",
    "92": "I-CORONAVIRUS",
    "93": "B-WILDLIFE",
    "94": "I-WILDLIFE",
    "95": "B-EXPERIMENTAL_MODEL_OF_DISEASE",
    "96": "I-EXPERIMENTAL_MODEL_OF_DISEASE",
    "97": "B-NORP",
    "98": "I-NORP",
    "99": "B-QUANTITY",
    "100": "I-QUANTITY",
    "101": "B-LAW",
    "102": "I-LAW",
    "103": "B-CELL_OR_MOLECULAR_DYSFUNCTION",
    "104": "I-CELL_OR_MOLECULAR_DYSFUNCTION",
    "105": "B-PERCENT",
    "106": "I-PERCENT",
    "107": "B-ANATOMICAL_STRUCTURE",
    "108": "I-ANATOMICAL_STRUCTURE",
    "109": "B-VIRUS",
    "110": "I-VIRUS",
    "111": "B-WORK_OF_ART",
    "112": "I-WORK_OF_ART",
    "113": "B-LABORATORY_PROCEDURE",
    "114": "I-LABORATORY_PROCEDURE",
    "115": "B-GROUP_ATTRIBUTE",
    "116": "I-GROUP_ATTRIBUTE",
    "117": "B-DISEASE_OR_SYNDROME",
    "118": "I-DISEASE_OR_SYNDROME",
    "119": "B-MOLECULAR_FUNCTION",
    "120": "I-MOLECULAR_FUNCTION",
    "121": "B-ORG",
    "122": "I-ORG",
    "123": "B-PRODUCT",
    "124": "I-PRODUCT",
    "125": "B-CHEMICAL",
    "126": "I-CHEMICAL"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ANATOMICAL_STRUCTURE": 107,
    "B-ARCHAEON": 77,
    "B-BACTERIUM": 7,
    "B-BODY_PART_ORGAN_OR_ORGAN_COMPONENT": 43,
    "B-BODY_SUBSTANCE": 19,
    "B-CARDINAL": 1,
    "B-CELL": 5,
    "B-CELL_COMPONENT": 11,
    "B-CELL_FUNCTION": 25,
    "B-CELL_OR_MOLECULAR_DYSFUNCTION": 103,
    "B-CHEMICAL": 125,
    "B-CORONAVIRUS": 91,
    "B-DAILY_OR_RECREATIONAL_ACTIVITY": 57,
    "B-DATE": 75,
    "B-DIAGNOSTIC_PROCEDURE": 63,
    "B-DISEASE_OR_SYNDROME": 117,
    "B-EDUCATIONAL_ACTIVITY": 35,
    "B-EUKARYOTE": 89,
    "B-EVENT": 47,
    "B-EVOLUTION": 31,
    "B-EXPERIMENTAL_MODEL_OF_DISEASE": 95,
    "B-FAC": 51,
    "B-FOOD": 37,
    "B-GENE_OR_GENOME": 61,
    "B-GOVERNMENTAL_OR_REGULATORY_ACTIVITY": 87,
    "B-GPE": 41,
    "B-GROUP": 71,
    "B-GROUP_ATTRIBUTE": 115,
    "B-HUMAN-CAUSED_PHENOMENON_OR_PROCESS": 29,
    "B-IMMUNE_RESPONSE": 33,
    "B-INDIVIDUAL_BEHAVIOR": 81,
    "B-INJURY_OR_POISONING": 69,
    "B-LABORATORY_OR_TEST_RESULT": 9,
    "B-LABORATORY_PROCEDURE": 113,
    "B-LANGUAGE": 39,
    "B-LAW": 101,
    "B-LIVESTOCK": 73,
    "B-LOC": 85,
    "B-MACHINE_ACTIVITY": 15,
    "B-MATERIAL": 55,
    "B-MOLECULAR_FUNCTION": 119,
    "B-MONEY": 53,
    "B-NORP": 97,
    "B-ORDINAL": 27,
    "B-ORG": 121,
    "B-ORGANISM": 3,
    "B-ORGAN_OR_TISSUE_FUNCTION": 59,
    "B-PERCENT": 105,
    "B-PERSON": 13,
    "B-PHYSICAL_SCIENCE": 83,
    "B-PRODUCT": 123,
    "B-QUANTITY": 99,
    "B-RESEARCH_ACTIVITY": 79,
    "B-SIGN_OR_SYMPTOM": 17,
    "B-SOCIAL_BEHAVIOR": 45,
    "B-SUBSTRATE": 23,
    "B-THERAPEUTIC_OR_PREVENTIVE_PROCEDURE": 65,
    "B-TIME": 21,
    "B-TISSUE": 49,
    "B-VIRAL_PROTEIN": 67,
    "B-VIRUS": 109,
    "B-WILDLIFE": 93,
    "B-WORK_OF_ART": 111,
    "I-ANATOMICAL_STRUCTURE": 108,
    "I-ARCHAEON": 78,
    "I-BACTERIUM": 8,
    "I-BODY_PART_ORGAN_OR_ORGAN_COMPONENT": 44,
    "I-BODY_SUBSTANCE": 20,
    "I-CARDINAL": 2,
    "I-CELL": 6,
    "I-CELL_COMPONENT": 12,
    "I-CELL_FUNCTION": 26,
    "I-CELL_OR_MOLECULAR_DYSFUNCTION": 104,
    "I-CHEMICAL": 126,
    "I-CORONAVIRUS": 92,
    "I-DAILY_OR_RECREATIONAL_ACTIVITY": 58,
    "I-DATE": 76,
    "I-DIAGNOSTIC_PROCEDURE": 64,
    "I-DISEASE_OR_SYNDROME": 118,
    "I-EDUCATIONAL_ACTIVITY": 36,
    "I-EUKARYOTE": 90,
    "I-EVENT": 48,
    "I-EVOLUTION": 32,
    "I-EXPERIMENTAL_MODEL_OF_DISEASE": 96,
    "I-FAC": 52,
    "I-FOOD": 38,
    "I-GENE_OR_GENOME": 62,
    "I-GOVERNMENTAL_OR_REGULATORY_ACTIVITY": 88,
    "I-GPE": 42,
    "I-GROUP": 72,
    "I-GROUP_ATTRIBUTE": 116,
    "I-HUMAN-CAUSED_PHENOMENON_OR_PROCESS": 30,
    "I-IMMUNE_RESPONSE": 34,
    "I-INDIVIDUAL_BEHAVIOR": 82,
    "I-INJURY_OR_POISONING": 70,
    "I-LABORATORY_OR_TEST_RESULT": 10,
    "I-LABORATORY_PROCEDURE": 114,
    "I-LANGUAGE": 40,
    "I-LAW": 102,
    "I-LIVESTOCK": 74,
    "I-LOC": 86,
    "I-MACHINE_ACTIVITY": 16,
    "I-MATERIAL": 56,
    "I-MOLECULAR_FUNCTION": 120,
    "I-MONEY": 54,
    "I-NORP": 98,
    "I-ORDINAL": 28,
    "I-ORG": 122,
    "I-ORGANISM": 4,
    "I-ORGAN_OR_TISSUE_FUNCTION": 60,
    "I-PERCENT": 106,
    "I-PERSON": 14,
    "I-PHYSICAL_SCIENCE": 84,
    "I-PRODUCT": 124,
    "I-QUANTITY": 100,
    "I-RESEARCH_ACTIVITY": 80,
    "I-SIGN_OR_SYMPTOM": 18,
    "I-SOCIAL_BEHAVIOR": 46,
    "I-SUBSTRATE": 24,
    "I-THERAPEUTIC_OR_PREVENTIVE_PROCEDURE": 66,
    "I-TIME": 22,
    "I-TISSUE": 50,
    "I-VIRAL_PROTEIN": 68,
    "I-VIRUS": 110,
    "I-WILDLIFE": 94,
    "I-WORK_OF_ART": 112,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.40.1",
  "vocab_size": 119547
}
